## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.name.azurecaf_name.this["main_rg"][0m will be created
[0m  [32m+[0m[0m resource "azurecaf_name" "this" {
      [32m+[0m[0m clean_input   = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m name          = "dev"
      [32m+[0m[0m passthrough   = false
      [32m+[0m[0m prefixes      = [
          [32m+[0m[0m "ch",
        ]
      [32m+[0m[0m random_length = 3
      [32m+[0m[0m random_string = "yod"
      [32m+[0m[0m resource_type = "azurerm_resource_group"
      [32m+[0m[0m result        = (known after apply)
      [32m+[0m[0m results       = (known after apply)
      [32m+[0m[0m separator     = "-"
      [32m+[0m[0m suffixes      = [
          [32m+[0m[0m "eastus",
        ]
      [32m+[0m[0m use_slug      = true
    }

[1m  # module.resource_group.azurerm_resource_group.this["main_rg"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "this" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "eastus"
      [32m+[0m[0m name     = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "dept"       = "dev"
          [32m+[0m[0m "intent"     = "dev environment provisioning"
          [32m+[0m[0m "managed_by" = "terraform"
          [32m+[0m[0m "owner"      = "DevOps"
        }
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m names           = {
      [32m+[0m[0m main_rg = {
          [32m+[0m[0m clean_input    = true
          [32m+[0m[0m id             = (known after apply)
          [32m+[0m[0m name           = "dev"
          [32m+[0m[0m passthrough    = false
          [32m+[0m[0m prefixes       = [
              [32m+[0m[0m "ch",
            ]
          [32m+[0m[0m random_length  = 3
          [32m+[0m[0m random_seed    = [90mnull[0m[0m
          [32m+[0m[0m random_string  = "yod"
          [32m+[0m[0m resource_type  = "azurerm_resource_group"
          [32m+[0m[0m resource_types = [90mnull[0m[0m
          [32m+[0m[0m result         = (known after apply)
          [32m+[0m[0m results        = (known after apply)
          [32m+[0m[0m separator      = "-"
          [32m+[0m[0m suffixes       = [
              [32m+[0m[0m "eastus",
            ]
          [32m+[0m[0m use_slug       = true
        }
    }
  [32m+[0m[0m resource_groups = {
      [32m+[0m[0m main_rg = {
          [32m+[0m[0m id         = (known after apply)
          [32m+[0m[0m location   = "eastus"
          [32m+[0m[0m managed_by = [90mnull[0m[0m
          [32m+[0m[0m name       = (known after apply)
          [32m+[0m[0m tags       = {
              [32m+[0m[0m dept       = "dev"
              [32m+[0m[0m intent     = "dev environment provisioning"
              [32m+[0m[0m managed_by = "terraform"
              [32m+[0m[0m owner      = "DevOps"
            }
          [32m+[0m[0m timeouts   = [90mnull[0m[0m
        }
    }
  [32m+[0m[0m tags            = {
      [32m+[0m[0m dept       = "dev"
      [32m+[0m[0m intent     = "dev environment provisioning"
      [32m+[0m[0m managed_by = "terraform"
      [32m+[0m[0m owner      = "DevOps"
    }
```
</details>